//별찍기 예제
/*
	******
//	******	
//	******
//	******
//	******	
//
//	   *
//	  ***
//	 *****
//
//	등등
//*/ 

#include <stdio.h>

int main() {
	int i, j, k;

	// 5x 5 별찍기
	//for (i = 1; i <= 5; ++i) {
	//	// 반복문의 조건만 조절하면 대부분 답이 나옴
	//	for (j = 1; j <= i; ++j) {
	//		printf("*");
	//	}
	//	printf("\n");
	//}

	printf("직각삼각형\n");
	for (i = 1; i <= 5; i++) {
		// k <= 5 - i 핵심!
		for (k = 1; k <= 5 - i; k++) {
			printf(" "); // 빈 공백을 추가
		}

		// 여기 조건식만 수정하면 피라미드
		for (j = 1; j <= i ; j++) {
			printf("*");
		}
		printf("\n");
		}

	printf("피라미드\n");
	for (i = 1; i <= 5; i++) {
		// k <= 5 - i 핵심!
		for (k = 1; k <= 5 - i; k++) {
			printf(" "); // 빈 공백을 추가
		}

		// 여기 조건식만 수정하면 피라미드
		for (j = 1; j <= 2 * i - 1; j++) {
			printf("*");
		}
		printf("\n");
	}


	return 0;
}